"use strict"

let x = parseFloat(prompt("Введите координату X", ''));
let y = parseFloat(prompt("Введите координату Y", ''));

if (y >= -x
	&& y <= 1
	&& y >= 0
	&& x >= -1
	&& x <= 0) {
	alert("Точка попадает в область");
} else  if (y >= x
	&& y <= 1
	&& y >= 0
	&& x >= 0
	&& x <= 1) {
	alert("Точка попадает в область");
} else  if (y <= -x
	&& y <= 0
	&& y >= -1
	&& x >= 0
	&& x <= 1) {
	alert("Точка попадает в область");
} else  if (-y >= -x
	&& y <= 0
	&& y >= -1
	&& x >= -1
	&& x <= 0) {
	alert("Точка попадает в область");
} else {
	alert("Точка НЕ попадает в область");
}